{"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Masking", "config": {"name": "masking_1", "trainable": true, "batch_input_shape": [null, 87, 1024], "dtype": "float32", "mask_value": 0.0}}, {"class_name": "CRF", "config": {"name": "crf_1", "trainable": true, "units": 7, "learn_mode": "join", "test_mode": "viterbi", "use_boundary": true, "use_bias": true, "sparse_target": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "chain_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "boundary_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0033204907085746527}}, "chain_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 1.0311989484534934e-07}}, "boundary_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "chain_constraint": null, "boundary_constraint": null, "bias_constraint": null, "input_dim": 1024, "unroll": false}}]}, "keras_version": "2.2.4", "backend": "tensorflow"}